# Exercise notebook 2: Cleaning up our act
This Jupyter notebook, for Week 2 of The Open University's [Learn to code for Data Analysis](https://www.futurelearn.com/courses/learn-to-code/) course, has code examples and coding activities for you. Remember to run the code in this notebook before you start.

You'll come across steps in the FutureLearn course directing you to this notebook. Once you've done the exercise, go back to FutureLearn to discuss it with your fellow learners and course facilitators and mark it as complete.

In [1]:
from pandas import *

##Exercise 1: Dataframes and CSV files

To read a CSV file into a dataframe you need to call the pandas function called <code>read_csv()</code>. The simplest usage of this function is with a single argument, a string that holds the name of the CSV file, for example.

In [2]:
df = read_csv('WHO POP TB all.csv')

###Dataframe attributes

An dataframe attribute is like a variable that can only be accessed in the context of a dataframe. Once such attribute is <code>columns</code> which holds a dataframe's column names.

In [16]:
df.columns

Index(['Country', 'Population (1000s)', 'TB deaths'], dtype='object')

###Dataframe rows
A dataframe has a default integer index for its rows, which starts at zero <code>0</code>. The `irow()` method returns the row at the given index.

In [4]:
df.irow(0) # first row, index 0

Country               Afghanistan
Population (1000s)          30552
TB deaths                   13000
Name: 0, dtype: object

In [5]:
df.irow(2) # third row, index 2

Country               Algeria
Population (1000s)      39208
TB deaths                5100
Name: 2, dtype: object

###The <code>head()</code> method

The `head()` method returns a dataframe with the first rows, as many as given in the argument. By default, if the argument is missing, it returns the first five rows.

In [6]:
df.head() # first five rows

       Country  Population (1000s)  TB deaths
0  Afghanistan               30552   13000.00
1      Albania                3173      20.00
2      Algeria               39208    5100.00
3      Andorra                  79       0.26
4       Angola               21472    6900.00

In [7]:
df.head(7) # first seven rows

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00

###The <code>tail()</code> method
The <code>tail()</code> method is similar to the <code>head()</code> method. If no argument is used, the last five rows of the dataframe are returned, otherwise the number of rows returned is dependent on the argument.

In [18]:
df.tail() # last five rows

                                Country  Population (1000s)  TB deaths
189  Venezuela (Bolivarian Republic of)               30405        480
190                            Viet Nam               91680      17000
191                               Yemen               24407        990
192                              Zambia               14539       3600
193                            Zimbabwe               14150       5700

###Selecting and displaying columns in a dataframe
You found in Week 1 that you can select and display the values for a single dataframe column by puting the name of the column (in quotes) within square brackets immediately after the dataframe's name. However you can also select and display the values for multiple columns too.

To get multiple columns you need to use a list. A list in Python is a number of items separated by commas within square brackets, for example `['Country', 'Population (1000s)']`. This list is then put within square brackets immediately after the dataframe's name. The resulting expression represents a new dataframe, just with those columns, and therefore any dataframe method can be applied to it, like for example `head()`:

In [9]:
df[['Country', 'Population (1000s)']].head()

       Country  Population (1000s)
0  Afghanistan               30552
1      Albania                3173
2      Algeria               39208
3      Andorra                  79
4       Angola               21472

###Applying methods to a dataframe column
The `irow()`, <code>head()</code> and <code>tail()</code> methods discussed above can be used with single columns.

In [10]:
df['TB deaths'].irow(2) # third value of deaths column

5100.0

In [11]:
df['Population (1000s)'].tail() # last five values of population column

189    30405
190    91680
191    24407
192    14539
193    14150
Name: Population (1000s), dtype: int64


###Tasks

In the code cell below, write the code to get and display the 55th row in the dataframe <code>df</code>.

In [20]:
df.irow(54)

Country               El Salvador
Population (1000s)           6340
TB deaths                      61
Name: 54, dtype: object

In the code cell below write the code to display the first 10 rows of the dataframe <code>df</code>.

In [21]:
df.head(10)

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00
7              Armenia                2977     170.00
8            Australia               23343      45.00
9              Austria                8495      29.00

In the code cell below, select and display the first eight rows from the <code>'Country'</code> and <code>'TB deaths'</code> columns.

In [22]:
df[['Country','TB deaths']].head(8)

               Country  TB deaths
0          Afghanistan   13000.00
1              Albania      20.00
2              Algeria    5100.00
3              Andorra       0.26
4               Angola    6900.00
5  Antigua and Barbuda       1.20
6            Argentina     570.00
7              Armenia     170.00

**Now go back to the Exercise 1 step in FutureLearn to discuss and mark it complete.**

##Exercise 2: Comparison operators
Python has the following comparison operators:

    == (equals)
    != (not equal)
    < (less than)
    > (greater than)
    <= (less than or equal to)
    >= (greater than or equal to)

The following code will get and display all the rows in `df` where it is `True` that the value in the `'Population (1000s)'` column is greater than `80000`.

In [12]:
df[df['Population (1000s)'] > 80000]

                      Country  Population (1000s)  TB deaths
13                 Bangladesh              156595      80000
23                     Brazil              200362       4400
36                      China             1393337      41000
53                      Egypt               82056        550
58                   Ethiopia               94101      30000
65                    Germany               82727        300
77                      India             1252140     240000
78                  Indonesia              249866      64000
85                      Japan              127144       2100
109                    Mexico              122332       2200
124                   Nigeria              173615     160000
128                  Pakistan              182143      49000
134               Philippines               98394      27000
141        Russian Federation              142834      17000
185  United States of America              320051        490
190                  Viet Nam               91680      17000

### Task
In the code cell below write code to find all the rows in <code>df</code> where TB deaths exceed 10000.

In [23]:
df[df['TB deaths'] > 10000]

                              Country  Population (1000s)  TB deaths
0                         Afghanistan               30552      13000
13                         Bangladesh              156595      80000
36                              China             1393337      41000
47   Democratic Republic of the Congo               67514      46000
58                           Ethiopia               94101      30000
77                              India             1252140     240000
78                          Indonesia              249866      64000
100                        Madagascar               22925      12000
115                        Mozambique               25834      18000
116                           Myanmar               53259      26000
124                           Nigeria              173615     160000
128                          Pakistan              182143      49000
134                       Philippines               98394      27000
141                Russian Federation              142834      17000
159                      South Africa               52776      25000
190                          Viet Nam               91680      17000

**Now go back to the Exercise 2 step in FutureLearn to discuss and mark it complete.**

##Exercise 3: Bitwise operators

Pandas has two operators to make more complicated queries. Use the operator `&` (means 'and') to select rows where two conditions are both true. Use the operator `|` (means 'or') to select rows where at least one condition is true. Don't forget to put parentheses around _each_ comparison. For example, the following expression selects only countries with a population over 80 million inhabitants **and** with more that 10 thousand deaths.

In [13]:
df[(df['Population (1000s)'] > 80000) & (df['TB deaths'] > 10000)]

                Country  Population (1000s)  TB deaths
13           Bangladesh              156595      80000
36                China             1393337      41000
58             Ethiopia               94101      30000
77                India             1252140     240000
78            Indonesia              249866      64000
124             Nigeria              173615     160000
128            Pakistan              182143      49000
134         Philippines               98394      27000
141  Russian Federation              142834      17000
190            Viet Nam               91680      17000

If the same columns will be used repeatedly in the program, the code becomes more readable if written as follows:

In [14]:
population = df['Population (1000s)']
deaths = df['TB deaths']
df[(population > 80000) & (deaths > 10000)]

                Country  Population (1000s)  TB deaths
13           Bangladesh              156595      80000
36                China             1393337      41000
58             Ethiopia               94101      30000
77                India             1252140     240000
78            Indonesia              249866      64000
124             Nigeria              173615     160000
128            Pakistan              182143      49000
134         Philippines               98394      27000
141  Russian Federation              142834      17000
190            Viet Nam               91680      17000

###Task
In the code cell below find  all the countries where the Population (1000s) is **less than or equal to** 50000 **or** TB deaths are **greater than or equal to** 20000.

In [24]:
population = df['Population (1000s)']
deaths = df['TB deaths']
df[(population <= 50000) | (deaths >= 20000)]

                                       Country  Population (1000s)  TB deaths
0                                  Afghanistan               30552   13000.00
1                                      Albania                3173      20.00
2                                      Algeria               39208    5100.00
3                                      Andorra                  79       0.26
4                                       Angola               21472    6900.00
5                          Antigua and Barbuda                  90       1.20
6                                    Argentina               41446     570.00
7                                      Armenia                2977     170.00
8                                    Australia               23343      45.00
9                                      Austria                8495      29.00
10                                  Azerbaijan                9413     360.00
11                                     Bahamas                 377       1.80
12                                     Bahrain                1332       9.60
13                                  Bangladesh              156595   80000.00
14                                    Barbados                 285       2.00
15                                     Belarus                9357     850.00
16                                     Belgium               11104      18.00
17                                      Belize                 332      20.00
18                                       Benin               10323    1300.00
19                                      Bhutan                 754      88.00
20            Bolivia (Plurinational State of)               10671     430.00
21                      Bosnia and Herzegovina                3829     190.00
22                                    Botswana                2021     440.00
24                           Brunei Darussalam                 418      13.00
25                                    Bulgaria                7223     150.00
26                                Burkina Faso               16935    1500.00
27                                     Burundi               10163    2300.00
28                               Côte d'Ivoire               20316    4000.00
29                                  Cabo Verde                 499     150.00
30                                    Cambodia               15135   10000.00
..                                         ...                 ...        ...
159                               South Africa               52776   25000.00
160                                South Sudan               11296    4500.00
161                                      Spain               46927     240.00
162                                  Sri Lanka               21273    1300.00
163                                      Sudan               37964    9700.00
164                                   Suriname                 539      12.00
165                                  Swaziland                1250    1100.00
166                                     Sweden                9571      13.00
167                                Switzerland                8078      17.00
168                       Syrian Arab Republic               21898     450.00
169                                 Tajikistan                8208     570.00
171  The former Yugoslav republic of Macedonia                2107      33.00
172                                Timor-Leste                1133     990.00
173                                       Togo                6817     810.00
174                                      Tonga                 105       2.50
175                        Trinidad and Tobago                1341      29.00
176                                    Tunisia               10997     230.00
178                               Turkmenistan                5240    1300.00
179                                     Tuvalu                  10       2.80
180                                     Uganda               37579    4100.00
181                                    Ukraine               45239    6600.00
182                       United Arab Emirates                9346      64.00
184                United Republic of Tanzania               49253    6000.00
186                                    Uruguay                3407      40.00
187                                 Uzbekistan               28934    2200.00
188                                    Vanuatu                 253      16.00
189         Venezuela (Bolivarian Republic of)               30405     480.00
191                                      Yemen               24407     990.00
192                                     Zambia               14539    3600.00
193                                   Zimbabwe               14150    5700.00

[180 rows x 3 columns]

**Now go back to the Exercise 3 step in FutureLearn to discuss and mark it complete.**

##Exercise 4: Display rows from dataframe

The 2014 Weather Underground data for London has been downloaded from the site as a CSV file and can now be read into a dataframe.

In [15]:
london = read_csv('London_2014.csv')
london.head()

OSError: File b'London_2014.csv' does not exist

### Removing initial spaces

There are too many columns for the dataframe to fit horizontally in this notebook, but they can be displayed separately.

In [ ]:
london.columns

This shows that <code>' Max Wind SpeedKm/h'</code> is prefixed by a space, as do other columm names such as <code>' Mean Humidity'</code> and <code>' Max Sea Level PressurehPa'</code>.

The  <code>read_csv()</code> function has interpreted spaces after commas as being part of the next value. This can be rectified  easily by adding another argument to the <code>read_csv()</code> function to skiop the initial spaces after a comma.

In [ ]:
london = read_csv('London_2014.csv', skipinitialspace=True)

### Removing extra characters

Another problem shown above is that the final column is called <code>'WindDirDegrees&lt; br /&gt;'</code>.

When the dataset was exported from the Weather Underground web site html line breaks were automatically added to each line in the file which <code>read_csv()</code> has interpreted as part of the column name and its values. This can be seen more clearly by looking at more values in the final column:

In [ ]:
london['WindDirDegrees<br />'].head()

<code>'WindDirDegrees&lt; br /&gt;'</code> can be changed to <code>'WindDirDegrees'</code> with the <code>rename()</code> method as follows:

In [ ]:
london = london.rename(columns={'WindDirDegrees<br />' : 'WindDirDegrees'})

To remove the <code>'&lt; br /&gt;'</code> html line breaks from the values in the <code>'WindDirDegrees'</code> column you need to use the string method <code>rstrip()</code> which is used to remove characters from the *end* or 'rear' of a string:

In [ ]:
london['WindDirDegrees'] = london['WindDirDegrees'].str.rstrip('<br />')

Display the first few rows of the <code>'WindDirDegrees'</code> to confirm the change:

In [ ]:
london['WindDirDegrees'].head()

### Missing values

Missing (also called null or not available) values are marked as NaN (not a number) in dataframes.

In [ ]:
london['Events'].tail()

The `isnull()` method returns `True` for each row in a column that has a null value. The method can be used to select and display those rows. Scroll the table below to the right to check that the events column is only showing missing values.

In [ ]:
london[london['Events'].isnull()]

One way to deal with missing values is to replace them by some value. The column method `fillna()` fills all not available value cells with the value given as argument. In the example below, each missing event is replaced by the empty string.

In [ ]:
london['Events'] = london['Events'].fillna('')
london[london['Events'].isnull()]

The empty dataframe (no rows) confirms there are no more missing event values.

Another way to deal with missing values is to ignore rows with them. The `dropna()` dataframe method returns a new dataframe where all rows with at least one non-available value have been removed.

In [ ]:
london.dropna()

Note that the table above has fewer than 251 of the original 365 rows, so there must be further null values besides the 114 missing events.

### Changing the value type of a column

The type of every column in a dataframe can be determined by looking at the dataframe's `dtypes` attribute, like this:

In [ ]:
london.dtypes

The type of all the values in a column can be changed using the <code>astype()</code> method. The following code will change the values in the <code>'WindDirDegrees'</code> column from strings (`object`) to integers (<code>int64</code>).

In [ ]:
london['WindDirDegrees'] = london['WindDirDegrees'].astype('int64')

The function `to_datetime()` is needed to change the values in the `'GMT'` column from strings (`object`) to dates (`datetime64`):

In [ ]:
london['GMT'] = to_datetime(london['GMT'])
london.dtypes

Values of type `datetime64` can be created using the `datetime()` function where the first integer argument is the year, the second the month and the third the day. 
The code below will get and display the row in the dataframe whose `'GMT'` value is 4th June 2014.

In [ ]:
london[london['GMT'] == datetime(2014, 6, 4)]

Queries such as 'Return all the rows where the date is between 8 December and 12 December' can be made:

In [ ]:
dates = london['GMT']
start = datetime(2014, 12, 8)
end = datetime(2014, 12, 12)
london[(dates >= start) & (dates <= end)]

###Tasks

Now that the wind direction is given by a number, write code to select all days that had a northerly wind. Hint: select the rows where the direction is greater or equal than 350 **or** smaller or equal than 10, as the compass rose shows.

In the code cell below, write code to get and display all the rows in the dataframe that are beween 1 April 2014 and 
11 April 2014.

In the cell below, write two lines of code to display the first five rows that have a missing value in the `'Max Gust SpeedKm/h'` column. Hint: first select the missing value rows and store them in a new dataframe, then display the first five rows of the new dataframe.

**Now go back to the Exercise 4 step in FutureLearn to discuss and mark it complete.**

##Exercise 5: Every picture tells a story

The following line of code tells Jupyter to display inside this notebook any graph that is created.

In [ ]:
%matplotlib inline

The `plot()` method can make a graph of the values in a column. Gridlines are turned on by the `grid` argument.

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True)

The graph can be made bigger by giving the method a `figsize=(x,y)` argument where `x` and `y` are integers that determine the length of the x-axis and y-axis.

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True, figsize=(10,5))

Multiple lines can be plotted by selecting multiple columns.

In [ ]:
london[['Max Wind SpeedKm/h', 'Mean Wind SpeedKm/h']].plot(grid=True, figsize=(10,5))

### Task

In the cell below, write code to plot the minimum, mean, and maximum temperature during 2014 in London.

**Now go back to the Exercise 5 step in FutureLearn to discuss and mark it complete.**

##Exercise 6: Changing a dataframe's index
Changing the dataframe's index from the default to `datetime64` values is done by assigning to the dataframe's `index` attribute the contents of the `'GMT`' column, like this:

In [ ]:
london.index = london['GMT']
london.head(2)

The `irow()` method can still be used to get and display rows, but now you can now also use the `datetime64` index to get a row using the dataframe's `ix` (index) property, like this:

In [ ]:
london.ix[datetime(2014, 1, 1)]

A query such as *'Return all the rows where the date is between December 8th and December 12th'* can now be done  succinctly like this:

In [ ]:
london.ix[datetime(2014,12,8) : datetime(2014,12,12)]

#The meaning of the above code is get the rows beween and including 
#the indices datetime(2014,12,8) and datetime(2014,12,12)

Now we have a `datetime64` index, let's plot `'Max Wind SpeedKm/h'` again:

In [ ]:
london['Max Wind SpeedKm/h'].plot(grid=True, figsize=(10,5))

Now it is much clearer that the worst winds were in mid February.

###Task
Use the code cell below to plot the values of `'Mean Humidity'` during spring (full months of March, April and May).

**Now go back to the Exercise 6 step in FutureLearn to discuss and mark it complete.**